[
  {
    "ed": [
      [
        "It seems that every new Three Kingdoms game, everyone wants to destroy Zhang Jue. But difference now I will take on this mission this time"
      ],
      [
        "Carefully think about it, I'm sad for Zhang Jue, he completely unaware of his own destiny. Although this time caused him to escape, history was determined",
        "red",
        "Retreat",
        "There is only 1 way. I can't stop",
        "red",
        "Chase and Zhang Jue",
        ", destroying Yellow Turban, just the first step to challenge......"
      ]
    ]
  },
  {
    "ed": [
      [
        "It's dangerous! Go for broke, Zhang Jue is naturally so powerful. The first mission was already this dangerous. It seems that we must constantly increase the strength of the army, there are many dangers ahead"
      ],
      [
        "Hello",
        "red",
        "Heroes",
        "Training",
        "red",
        "Skill",
        ", ",
        "red",
        "Reinforcement Training",
        "……In closing, using all tricks to quickly strengthen",
        "red",
        "Retreat",
        ", I can't lose！"
      ]
    ],
    "op": [
      [
        "red",
        "Gan Ning",
        "！who that I can use at will, the fighting spirit is high, I really want to crush all my enemy."
      ],
      [
        "The army gradually grew stronger",
        "red",
        "Retreat",
        "Hoping……"
      ]
    ]
  },
  {
    "op": [
      [
        "Now nothing can't stop me, my reputation will gradually spread…that will bring many good places ！"
      ],
      [
        "Zhang Jue is dead, the news has spread throughout the north and south, where are our troops going, the yellow turbans must be Retreat, Only a few remnants of the party had to rely on dangerous places to fight back. Although they are the remnants of the army, they are also the elite of the yellow turbans.",
        "red",
        "Well trained",
        "Need a drum sound to energize the spirit, go ahead and clean all the yellow turbans ……"
      ]
    ],
    "ed": [
      [
        "It's dangerous, we defeat Zhou Cang finally"
      ],
      [
        "I've never felt so strong like that, ",
        "red",
        "Level Up Heroes",
        ", harvest",
        "red",
        "the lastest equipment",
        "Get",
        "red",
        "mission reward",
        "draw",
        "red",
        "activity reward",
        ", Only by constantly becoming powerful, we can stand firm in the chaos of the Three Kingdoms！"
      ]
    ]
  },
  {
    "op": [
      [
        "After the yellow turbans was removed, all the vassals returned to the city. I don't even have time to enjoy the joy of victory.“",
        "red",
        "Mission",
        "silently coming..."
      ],
      [
        "highest ambition",
        "red",
        "Dong Zhuo",
        ", On the occasion of the Han dynasty's decline, bringing trusted subordinates to escape",
        "red",
        "great Western Liang army",
        ", huge army marches to Luoyang, If you can't stop it in time, The Han Jiangshan will definitely change hands, I'm just afraid I won't have a chance",
        "red",
        "back to the future",
        "Go"
      ],
      [
        "The army's fighting spirit has not decreased, Diaochan decided to command Luoyang, attack Dong Zhuo great army.……"
      ]
    ]
  },
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  []
]